[
  {
    "id": 1,
    "title": "Cold War",
    "image_path": "C:\\Users\\ShySkill\\Downloads\\APUSH\\posters\\poster.jpg",
    "explanation": "This poster is a cool graphic that showcases both John F. Kennedy and Nikita Khrushchev. Although this poster does not feature propaganda and was made more recently, it showcases the schism between the sides and gives someone who has never heard of the Cold War before a good idea. It also shows how the Communists were more radical and aggressive.",
    "designer": "Yaojing Posters",
    "year": 2012
  },
  {
    "id": 2,
    "title": "CCCP Pro-War Poster",
    "image_path": "posters/poster1.jpg",
    "explanation": "This poster was made to create a nationalistic sentiment among the communists. When translated, this poster states \"Strengthen your defense\". It also shows the CCCP, which is a Cyrillic abbreviation for \"USSR\", which stands for \"Union of Soviet Socialist Republics\" (in English). They depict wartime planes in the background as a show of strength and promoting nationalism.",
    "designer": "Pavel Petrovich Sokolov-Skalya",
    "year": 1951
  },
  {
    "id": 3,
    "title": "A strong America can prevent an atomic war",
    "image_path": "C:\\Users\\ShySkill\\Downloads\\APUSH\\posters\\poster2.jpg",
    "explanation": "This poster aims to grab the attention of the viewer, and it is tailored towards American audiences. Similar to the previous CCCP posters, this aims to promote investments in the military and create a nationalist sentiment. It also preys on the fears of most Americans at this time, which was atomic war.",
    "designer": "Ace Comics",
    "year": 1952
  },
  {
    "id": 4,
    "title": "The Red Iceberg",
    "image_path": "C:\\Users\\ShySkill\\Downloads\\APUSH\\posters\\poster3.jpg",
    "explanation": "This poster uses the sensitive idea of the Titanic to show how the US can be stopped by these communist countries. It depicts the stereotypical Uncle Sam, who is riding a boat through the ocean, and can be stopped by the Red iceberg. This is a metaphor for the US's growth with the capitalist system. This created anger among Americans.",
    "designer": "Unknown",
    "year": 1953
  },
  {
    "id": 5,
    "title": "Today in Chile - Soviet Union",
    "image_path": "C:\\Users\\ShySkill\\Downloads\\APUSH\\posters\\poster4.jpg",
    "explanation": "This is a poster made by the Soviets, with a poem that goes along the lines of \"Every name the people will mourn, Everyone on the death list will be marked, For every victim the executioner will pay, For every bullet, he will answer.\" This depicts the soldiers as sinister and faceless executioners. This poster aimed to make people criticize the US-backed regimes during the Cold War.",
    "designer": "Maxim Gorky",
    "year": 1978
  },
  {
    "id": 6,
    "title": "No Landing Area",
    "image_path": "C:\\Users\\ShySkill\\Downloads\\APUSH\\posters\\poster5.jpg",
    "explanation": "This poster shows US businessmen traveling over a group of spikes that say positive things. They are being propelled by money, which symbolizes how the US and its capitalist system prioritize money over world peace, disregarding what fears the Soviets might have. This aims to pinpoint the US's greed among Soviets.",
    "designer": "Russian School",
    "year": 1967
  },
  {
    "id": 7,
    "title": "Is this Tomorrow?",
    "image_path": "C:\\Users\\ShySkill\\Downloads\\APUSH\\posters\\poster6.jpg",
    "explanation": "This is a very basic poster created by Americans during the Cold War. It depicts American soldiers and working-class people on fire and burning to death, with the caption \"America under communism\". Although this poster is pretty straightforward, it shows how badly the idea of communism sat with people.",
    "designer": "Unknown",
    "year": 1947
  },
  {
    "id": 8,
    "title": "The Soviet Union Needs You!",
    "image_path": "C:\\Users\\ShySkill\\Downloads\\APUSH\\posters\\poster7.jpg",
    "explanation": "Posters like these were created during the Cuban Missile Crisis, as people were terrified of the effects of nuclear weapons. As a result, they started to make posters asking for a nuclear freeze and for the production of nuclear missiles to be stopped, in order to ensure better world peace. The Soviets knew that many lives were at risk, and thus felt the need to make these posters.",
    "designer": "College Republican National Committee",
    "year": 1982
  },
  {
    "id": 9,
    "title": "Believers are Persecuted",
    "image_path": "C:\\Users\\ShySkill\\Downloads\\APUSH\\posters\\poster8.jpg",
    "explanation": "This poster states that believers are persecuted, as the US will take you away if you are Christian. This was another form of propaganda used, as they would target things that people would identify with, such as religion. It also illustrates the Soviet Union’s view that Western media has misunderstood the intentions of Soviet law enforcement. As a Soviet policeman is arresting a man wearing a cross, another man, from the United States, is taking a picture of the arrest with the camera aimed at the cross.",
    "designer": "Efimovsky",
    "year": 1979
  },
  {
    "id": 10,
    "title": "Old Hooters of the Anti-Soviet Duck Pipe",
    "image_path": "C:\\Users\\ShySkill\\Downloads\\APUSH\\posters\\poster9.jpg",
    "explanation": "This poster uses symbolism to show how the US is funding bombs that will later be dropped on the Soviets, because of the man playing the Anti-Soviet Duck Pipe, which represents the anti-Soviet sentiment in the US.",
    "designer": "Abramov, M",
    "year": 1979
  },
  {
    "id": 11,
    "title": "Uncle Sam Vs the USSR",
    "image_path": "C:\\Users\\ShySkill\\Downloads\\APUSH\\posters\\poster10.jpg",
    "explanation": "This poster uses symbolism to depict the United States, represented by a menacing Uncle Sam, as aggressively encircling the USSR with military pressure, using allied nations like Japan, China, Pakistan, Israel, and Western Europe as tools of containment and intimidation. The small Soviet bear facing the looming threat illustrates how the USSR perceived itself as surrounded and under siege during the Cold War.",
    "designer": "Unknown",
    "year": 1949
  },
  {
    "id": 12,
    "title": "Religious Extremist Slanders the Soviet System",
    "image_path": "C:\\Users\\ShySkill\\Downloads\\APUSH\\posters\\poster11.jpg",
    "explanation": "This Soviet propaganda poster uses symbolism to portray the United States as a manipulative force baiting religious extremists (labeled on the figure) with money and lies, represented by the dollar-sign hook and a lure decorated in the U.S. flag. The extremist figure, clutching a document that reads “Slander against the Soviet system,” is shown as foolishly taking the bait, suggesting that U.S. influence corrupts and deceives weak-minded enemies of the USSR through greed and falsehoods.",
    "designer": "Unknown",
    "year": 1948
  },
  {
    "id": 13,
    "title": "Anti-War Poster for the Soviets",
    "image_path": "C:\\Users\\ShySkill\\Downloads\\APUSH\\posters\\poster12.jpg",
    "explanation": "This poster uses symbolism to portray the unity and strength of the Soviet people rallying for peace and democracy, as the bold central figure leads a mass movement under red banners, while the text below condemns the \"arsonists of a new war,\" represented by shadowy capitalist figures, suggesting Western powers are instigating global conflict.",
    "designer": "Published by Lib. of Cong - Unknown",
    "year": 1949
  },
  {
    "id": 14,
    "title": "Stop Communism",
    "image_path": "C:\\Users\\ShySkill\\Downloads\\APUSH\\posters\\poster13.jpg",
    "explanation": "This poster uses symbolism to portray communism as a global threat, with a Soviet figure stomping across the world while swinging a sword labeled “Democracy,” suggesting a violent clash between ideologies. The dramatic imagery and bold slogan urge collective action, reinforcing the idea that fighting communism is a shared and urgent responsibility for all.",
    "designer": "Unknown",
    "year": 1951
  },
  {
    "id": 15,
    "title": "The World is Invincible!",
    "image_path": "C:\\Users\\ShySkill\\Downloads\\APUSH\\posters\\poster14.jpg",
    "explanation": "This poster uses symbolism to depict the power of global peace movements outweighing the forces of war, as a massive, muscular foot labeled \"Supporters of Peace\" tips the scale against a chaotic pile of caricatured capitalists and warmongers. The message emphasizes that unity for peace is stronger and more righteous than the corrupt, destabilizing influence of Western imperialists.",
    "designer": "Nikolai Andreevich Dolgorukov",
    "year": 1949
  },
  {
    "id": 16,
    "title": "US Policy is a Policy of War and Social Disaster!",
    "image_path": "C:\\Users\\ShySkill\\Downloads\\APUSH\\posters\\poster15.png",
    "explanation": "This poster uses stark contrast and imagery of protest to depict the United States as a nation plagued by internal unrest and social injustice, symbolized by the police confronting demonstrators in front of the Capitol. The Russian text translates to “U.S. policy—a policy of war and social disasters!”, reinforcing the Soviet message that American society is driven by aggression and inequality.",
    "designer": "Kudryashova Claudia Andreevna",
    "year": 1983
  },
  {
    "id": 17,
    "title": "America Under Socialism",
    "image_path": "C:\\Users\\ShySkill\\Downloads\\APUSH\\posters\\poster16.PNG",
    "explanation": "This poster uses exaggerated imagery to portray socialism as a force that shuts down industry and robs workers of opportunity, symbolized by the armed guard and “Factory Closed” sign. The dejected expressions of the idle workers suggest that government control leads to economic decay and loss of personal freedom.",
    "designer": "Published by The NRB - Unknown",
    "year": 1950
  }
]